In [2]:
import pandas as pd
dataku=pd.read_csv("mydata.csv",names=["nama","usia"])
dataku.describe()

            usia
count  10.000000
mean    8.000000
std     4.521553
min     1.000000
25%     4.750000
50%     8.500000
75%    11.500000
max    14.000000

In [5]:
dataku.loc[1:6]

              nama  usia
1   Annisa Hanifah     8
2      Siti Rohmah    10
3        Ali Akbar     4
4     Novan Wijaya    13
5    Muhammad Umar    14
6  Aisyah Syarifah    12